Repository: wasimmostakim2965-ui/openclaw-windows-node
Catalog: src/OpenClaw.Tray.WinUI/Strings/*/Resources.resw
Source language: en_us
Languages: fr_fr, pt_br, zh_cn, zh_tw

# Onboarding_Wizard_OfflineMessage
source: The gateway provides dynamic setup steps. These will run when the connection is established.
fr_fr: La passerelle fournit des étapes de configuration dynamiques. Celles-ci s'exécuteront une fois la connexion établie.
pt_br: O Gateway fornece etapas de configuração dinâmicas. Elas serão executadas quando a conexão for estabelecida.
zh_cn: 网关提供动态配置步骤，将在连接建立后执行。
zh_tw: 閘道提供動態設定步驟，將在連線建立後執行。

# Onboarding_Perm_Notifications
source: Notifications
fr_fr: Alertes
pt_br: Notificações
zh_cn: 通知
zh_tw: 通知

# Onboarding_Perm_Camera
source: Camera
fr_fr: Caméra
pt_br: Câmera
zh_cn: 摄像头
zh_tw: 相機

# Onboarding_Perm_Microphone
source: Microphone
fr_fr: Micro
pt_br: Microfone
zh_cn: 麦克风
zh_tw: 麥克風

# Onboarding_Perm_ScreenCapture
source: Screen Capture
fr_fr: Capture d'écran
pt_br: Captura de tela
zh_cn: 屏幕截图
zh_tw: 螢幕擷取

# Onboarding_Perm_Location
source: Location (optional)
fr_fr: Localisation (optionnel)
pt_br: Localização (opcional)
zh_cn: 位置（可选）
zh_tw: 位置（選用）

# Onboarding_Perm_Enabled
source: Enabled
fr_fr: Activé
pt_br: Ativado
zh_cn: 已启用
zh_tw: 已啟用

# Onboarding_Perm_EnabledDefault
source: Enabled (default)
fr_fr: Activé (par défaut)
pt_br: Ativado (padrão)
zh_cn: 已启用（默认）
zh_tw: 已啟用（預設）

# Onboarding_Perm_Disabled
source: Disabled
fr_fr: Désactivé
pt_br: Desativado
zh_cn: 已禁用
zh_tw: 已停用

# Onboarding_Perm_DisabledManifest
source: Disabled in app manifest
fr_fr: Désactivé dans le manifeste
pt_br: Desativado no manifesto do aplicativo
zh_cn: 在应用清单中已禁用
zh_tw: 在應用程式資訊清單中已停用

# Onboarding_Perm_DisabledPolicy
source: Disabled by policy
fr_fr: Désactivé par la stratégie
pt_br: Desativado pela política
zh_cn: 被策略禁用
zh_tw: 被原則停用

# Onboarding_Perm_DisabledUser
source: Disabled: open Settings to enable
fr_fr: Désactivé: ouvrir les paramètres pour activer
pt_br: Desativado: abra as configurações para ativar
zh_cn: 已禁用: 打开设置以启用
zh_tw: 已停用: 開啟設定以啟用

# Onboarding_Perm_Allowed
source: Allowed
fr_fr: Autorisé
pt_br: Permitido
zh_cn: 已允许
zh_tw: 已允許

# Onboarding_Perm_DeniedUser
source: Denied: open Settings to allow
fr_fr: Refusé: ouvrir les paramètres pour autoriser
pt_br: Negado: abra as Configurações para permitir
zh_cn: 被拒绝: 打开设置以允许
zh_tw: 被拒絕: 開啟設定以允許

# Onboarding_Perm_DeniedSystem
source: Denied by system policy
fr_fr: Refusé par la stratégie système
pt_br: Negado pela política do sistema
zh_cn: 被系统策略拒绝
zh_tw: 被系統原則拒絕

# Onboarding_Perm_NotDetermined
source: Not determined: open Settings
fr_fr: Non déterminé: ouvrir les paramètres
pt_br: Não determinado: abra as Configurações
zh_cn: 未确定: 打开设置
zh_tw: 未確定: 開啟設定

# Onboarding_Perm_UnableToCheck
source: Unable to check
fr_fr: Impossible à vérifier
pt_br: Não foi possível verificar
zh_cn: 无法检查
zh_tw: 無法檢查

# Onboarding_Perm_NoCameraDetected
source: No camera detected
fr_fr: Aucune caméra détectée
pt_br: Nenhuma câmera detectada
zh_cn: 未检测到相机
zh_tw: 未偵測到相機

# Onboarding_Perm_NoMicDetected
source: No microphone detected
fr_fr: Aucun microphone détecté
pt_br: Nenhum microfone detectado
zh_cn: 未检测到麦克风
zh_tw: 未偵測到麥克風

# Onboarding_Perm_ScreenCaptureAvailable
source: Available: uses picker per capture
fr_fr: Disponible: utilise un sélecteur par capture
pt_br: Disponível: usa o seletor a cada captura
zh_cn: 可用: 每次截图使用选择器
zh_tw: 可用: 每次擷取使用選擇器

# Onboarding_Perm_NotSupported
source: Not supported on this device
fr_fr: Non pris en charge sur cet appareil
pt_br: Não compatível com este dispositivo
zh_cn: 此设备不支持
zh_tw: 此裝置不支援

# Onboarding_Perm_LocationDisabledSystem
source: Location services disabled system-wide
fr_fr: Services de localisation désactivés à l'échelle du système
pt_br: Os serviços de localização estão desativados em todo o sistema
zh_cn: 位置服务已在系统范围内禁用
zh_tw: 定位服務已在系統範圍停用

# Onboarding_Perm_LocationDisabledUser
source: Location disabled for this user
fr_fr: Localisation désactivée pour cet utilisateur
pt_br: Localização desativada para este usuário
zh_cn: 此用户的位置已禁用
zh_tw: 此使用者的位置已停用

# Onboarding_Perm_LocationEnabled
source: Location services enabled
fr_fr: Services de localisation activés
pt_br: Serviços de localização ativados
zh_cn: 位置服务已启用
zh_tw: 定位服務已啟用

# Onboarding_Ready_Feature_TrayMenu_Subtitle
source: Access from system tray
fr_fr: Accéder depuis la barre des tâches
pt_br: Acesso pela bandeja do sistema
zh_cn: 从系统托盘访问
zh_tw: 從系統匣存取

# Onboarding_Ready_Feature_Channels_Subtitle
source: Settings → Channels
fr_fr: Paramètres → Canaux
pt_br: Configurações → Canais
zh_cn: 设置 → 频道
zh_tw: 設定 → 頻道

# Onboarding_Ready_Feature_Voice_Subtitle
source: Wake with your voice
fr_fr: Réveillez avec votre voix
pt_br: Ative com sua voz
zh_cn: 用语音唤醒
zh_tw: 用語音喚醒

# Onboarding_Ready_Feature_Canvas_Subtitle
source: Visual workspace
fr_fr: Espace de travail visuel
pt_br: Espaço de trabalho visual
zh_cn: 视觉工作区
zh_tw: 視覺工作區

# Onboarding_Ready_Feature_Skills_Subtitle
source: Settings → Skills
fr_fr: Paramètres → Compétences
pt_br: Configurações → Skills
zh_cn: 设置 → 技能
zh_tw: 設定 → 技能

# Onboarding_Connection_StatusOriginBlocked
source: Origin not allowed: gateway rejects this connection
fr_fr: Origine non autorisée: la passerelle rejette cette connexion
pt_br: Origem não permitida: o Gateway rejeita esta conexão
zh_cn: 来源不允许: 网关拒绝此连接
zh_tw: 來源不允許: 閘道拒絕此連線

# Onboarding_Connection_StatusRateLimited
source: Rate limited: wait a moment and try again
fr_fr: Limite de débit atteinte: attendez un moment et réessayez
pt_br: Limite de requisições atingido: aguarde um momento e tente novamente
zh_cn: 速率限制: 请稍等后重试
zh_tw: 速率限制: 請稍候再試

# Onboarding_Connection_RunOnGateway
source: Run on your gateway:
fr_fr: Exécutez sur votre passerelle :
pt_br: Execute no seu Gateway:
zh_cn: 在您的网关上运行：
zh_tw: 在您的閘道上執行：

# Onboarding_Connection_ClickToCopy
source: Click to copy
fr_fr: Cliquer pour copier
pt_br: Clique para copiar
zh_cn: 点击复制
zh_tw: 點擊複製

# Onboarding_Connection_CopyFailed
source: Copy failed: click to retry
fr_fr: Échec de la copie: cliquez pour réessayer
pt_br: Falha ao copiar: clique para tentar novamente
zh_cn: 复制失败: 点击重试
zh_tw: 複製失敗: 點擊重試

# Onboarding_Connection_Copied
source: Copied!
fr_fr: Copié !
pt_br: Copiado!
zh_cn: 已复制！
zh_tw: 已複製！

# Onboarding_Connection_StatusFailed
source: Connection failed: check URL and token, then try again
fr_fr: Échec de la connexion: vérifiez l'URL et le jeton, puis réessayez
pt_br: Falha na conexão: verifique a URL e o token e tente novamente
zh_cn: 连接失败: 请检查 URL 和令牌，然后重试
zh_tw: 連線失敗: 請檢查 URL 和權杖，然後重試

# Onboarding_Wizard_StepError
source: An error occurred processing this step
fr_fr: Une erreur est survenue lors du traitement de cette étape
pt_br: Ocorreu um erro ao processar esta etapa
zh_cn: 处理此步骤时出错
zh_tw: 處理此步驟時發生錯誤

# Onboarding_Connection_StatusDetecting
source: Detecting gateway...
fr_fr: Détection de la passerelle...
pt_br: Detectando Gateway...
zh_cn: 正在检测网关...
zh_tw: 正在偵測閘道...

# Onboarding_Connection_StatusDetected
source: Gateway detected on dev port
fr_fr: Passerelle détectée sur le port dev
pt_br: Gateway detectado na porta de desenvolvimento
zh_cn: 已在开发端口检测到网关
zh_tw: 已在開發連接埠偵測到閘道

# Onboarding_Connection_StatusAuthenticating
source: Authenticating...
fr_fr: Authentification...
pt_br: Autenticando...
zh_cn: 正在验证...
zh_tw: 正在驗證...

# Onboarding_Connection_Wsl
source: WSL Gateway
fr_fr: Passerelle WSL
pt_br: Gateway WSL
zh_cn: WSL 网关
zh_tw: WSL 閘道

# Onboarding_Connection_Ssh
source: SSH Tunnel
fr_fr: Tunnel SSH
pt_br: Túnel SSH
zh_cn: SSH 隧道
zh_tw: SSH 通道

# Onboarding_Connection_PasteSetup
source: Paste
fr_fr: Coller
pt_br: Colar
zh_cn: 粘贴
zh_tw: 貼上

# Onboarding_Connection_QrFilePickerTitle
source: Import QR image
fr_fr: Importer une image QR
pt_br: Importar imagem de QR
zh_cn: 导入二维码图像
zh_tw: 匯入 QR 影像

# Onboarding_Connection_QrDecodeFailed
source: Could not decode setup code from this image
fr_fr: Impossible de décoder le code de configuration de cette image
pt_br: Não foi possível decodificar o código de configuração desta imagem
zh_cn: 无法从此图像解码安装代码
zh_tw: 無法從此影像解碼設定代碼

# Onboarding_Connection_SshHint
source: OpenClaw will create a managed SSH tunnel to forward the gateway port from the remote host to this PC.
fr_fr: OpenClaw créera un tunnel SSH géré pour transférer le port de la passerelle de l’hôte distant vers ce PC.
pt_br: O OpenClaw criará um túnel SSH gerenciado para encaminhar a porta do Gateway do host remoto para este PC.
zh_cn: OpenClaw 将创建托管 SSH 隧道，把远程主机上的网关端口转发到此电脑。
zh_tw: OpenClaw 將建立受控 SSH 通道，將遠端主機上的閘道連接埠轉送到此電腦。

# Onboarding_Connection_SshUser
source: SSH User
fr_fr: Utilisateur SSH
pt_br: Usuário SSH
zh_cn: SSH 用户
zh_tw: SSH 使用者

# Onboarding_Connection_SshHost
source: SSH Host
fr_fr: Hôte SSH
pt_br: Host SSH
zh_cn: SSH 主机
zh_tw: SSH 主機

# Onboarding_Connection_SshRemotePort
source: Remote Gateway Port
fr_fr: Port de la passerelle distante
pt_br: Porta remota do Gateway
zh_cn: 远程网关端口
zh_tw: 遠端閘道連接埠

# Onboarding_Connection_SshLocalPort
source: Local Forward Port
fr_fr: Port local de transfert
pt_br: Porta de encaminhamento local
zh_cn: 本地转发端口
zh_tw: 本地轉送連接埠

# Onboarding_Connection_SshPreviewLabel
source: Managed tunnel:
fr_fr: Tunnel géré :
pt_br: Túnel gerenciado:
zh_cn: 托管隧道：
zh_tw: 受控通道：

# Onboarding_Connection_SshUserInvalid
source: Enter a valid SSH user before connecting.
fr_fr: Saisissez un utilisateur SSH valide avant de vous connecter.
pt_br: Insira um usuário SSH válido antes de conectar.
zh_cn: 请在连接前输入有效的 SSH 用户。
zh_tw: 連線前請輸入有效的 SSH 使用者。

# Onboarding_Connection_SshHostInvalid
source: Enter a valid SSH host (e.g., mac-studio.local) before connecting.
fr_fr: Saisissez un hôte SSH valide (par exemple mac-studio.local) avant de vous connecter.
pt_br: Insira um host SSH válido (por exemplo, mac-studio.local) antes de conectar.
zh_cn: 请在连接前输入有效的 SSH 主机（例如 mac-studio.local）。
zh_tw: 連線前請輸入有效的 SSH 主機（例如 mac-studio.local）。

# Onboarding_Connection_TopologyDetectedFmt
source: Detected: {0}
fr_fr: Détecté : {0}
pt_br: Detectado: {0}
zh_cn: 已检测：{0}
zh_tw: 已偵測：{0}

# Onboarding_Connection_LaterStatus
source: You can configure the gateway later in Settings.
fr_fr: Vous pouvez configurer la passerelle plus tard dans les paramètres.
pt_br: Você pode configurar o Gateway mais tarde nas Configurações.
zh_cn: 您可以稍后在“设置”中配置网关。
zh_tw: 您可以稍後在「設定」中設定閘道。

# Onboarding_SetupWarning_Title
source: Set up OpenClaw
fr_fr: Configurer OpenClaw
pt_br: Configurar o OpenClaw
zh_cn: 设置 OpenClaw
zh_tw: 設定 OpenClaw

# Onboarding_SetupWarning_Body
source: OpenClaw lets agents run commands, read and write files, and capture screenshots on this PC. Only set it up on a computer you trust. ⚠️ The local setup installs a small WSL Linux instance dedicated to OpenClaw. If you'd rather connect to an existing or remote gateway, choose Advanced setup.
fr_fr: OpenClaw permet aux agents d'exécuter des commandes, de lire et d'écrire des fichiers, et de capturer des captures d'écran sur ce PC. Ne le configurez que sur un ordinateur de confiance. ⚠️ La configuration locale installe une petite instance WSL Linux dédiée à OpenClaw. Si vous préférez vous connecter à une passerelle existante ou distante, choisissez Configuration avancée.
pt_br: O OpenClaw permite que agentes executem comandos, leiam e gravem arquivos e capturem capturas de tela neste PC. Configure-o somente em um computador em que você confia. ⚠️ A configuração local instala uma pequena instância Linux do WSL dedicada ao OpenClaw. Se preferir conectar a um Gateway existente ou remoto, escolha a configuração avançada.
zh_cn: OpenClaw 允许代理在此电脑上运行命令、读写文件以及捕获屏幕截图。仅在您信任的计算机上进行设置。 ⚠️ 本地设置将安装一个专用于 OpenClaw 的小型 WSL Linux 实例。如果您希望连接到现有或远程网关，请选择“高级设置”。
zh_tw: OpenClaw 允許代理在此電腦上執行命令、讀寫檔案以及擷取螢幕畫面。僅在您信任的電腦上進行設定。 ⚠️ 本機設定將安裝一個專用於 OpenClaw 的小型 WSL Linux 執行個體。如果您希望連線到現有或遠端閘道，請選擇「進階設定」。

# Onboarding_SetupWarning_SetupLocally
source: Set up locally
fr_fr: Configurer localement
pt_br: Configurar localmente
zh_cn: 本地设置
zh_tw: 本機設定

# Onboarding_SetupWarning_Advanced
source: Advanced setup
fr_fr: Configuration avancée
pt_br: Configuração avançada
zh_cn: 高级设置
zh_tw: 進階設定

# Onboarding_SetupWarning_ReplaceHeading
source: ⚠️ Replace existing configuration?
fr_fr: ⚠️ Remplacer la configuration existante ?
pt_br: ⚠️ Substituir configuração existente?
zh_cn: ⚠️ 替换现有配置？
zh_tw: ⚠️ 取代現有設定？

# Onboarding_SetupWarning_ReplaceBody
source: Moving forward will disconnect from the current gateway and lose all settings.
fr_fr: Continuer déconnectera de la passerelle actuelle et effacera tous les paramètres.
pt_br: Continuar desconectará do Gateway atual e fará você perder todas as configurações.
zh_cn: 继续操作将断开与当前网关的连接并丢失所有设置。
zh_tw: 繼續將會中斷與目前閘道的連線並遺失所有設定。

# Onboarding_SetupWarning_ReplaceConfirm
source: Replace my setup
fr_fr: Remplacer ma configuration
pt_br: Substituir minha configuração
zh_cn: 替换我的设置
zh_tw: 取代我的設定

# Onboarding_SetupWarning_ReplaceCancel
source: Keep my setup
fr_fr: Conserver ma configuration
pt_br: Manter minha configuração
zh_cn: 保留我的设置
zh_tw: 保留我的設定

# Onboarding_LocalSetup_Title
source: Setting up locally
fr_fr: Configuration locale en cours
pt_br: Configurando localmente
zh_cn: 正在本地设置
zh_tw: 正在本機設定

# Onboarding_LocalSetup_SubtitleIdle
source: Setting up your local OpenClaw gateway.
fr_fr: Configuration de votre passerelle OpenClaw locale.
pt_br: Configurando seu Gateway local do OpenClaw.
zh_cn: 正在设置您的本地 OpenClaw 网关。
zh_tw: 正在設定您的本機 OpenClaw 閘道。

# Onboarding_LocalSetup_SubtitleSuccess
source: Local gateway is ready.
fr_fr: La passerelle locale est prête.
pt_br: O Gateway local está pronto.
zh_cn: 本地网关已就绪。
zh_tw: 本機閘道已就緒。

# Onboarding_LocalSetup_Retry
source: Try again
fr_fr: Réessayer
pt_br: Tentar novamente
zh_cn: 重试
zh_tw: 重試

# Onboarding_LocalSetup_TerminalFailure
source: Setup did not complete.
fr_fr: La configuration n'a pas abouti.
pt_br: A configuração não foi concluída.
zh_cn: 设置未完成。
zh_tw: 設定未完成。

# Onboarding_LocalSetup_DiagnosticsHint
source: Diagnostics: aka.ms/wsllogs
pt_br: Diagnóstico: aka.ms/wsllogs
zh_cn: 诊断：aka.ms/wsllogs
zh_tw: 診斷：aka.ms/wsllogs

# Onboarding_LocalSetup_Phase_Preflight
source: Checking system
fr_fr: Vérification du système
pt_br: Verificando o sistema
zh_cn: 正在检查系统
zh_tw: 正在檢查系統

# Onboarding_LocalSetup_Phase_CreateInstance
source: Installing Ubuntu
fr_fr: Installation d'Ubuntu
pt_br: Instalando o Ubuntu
zh_cn: 正在安装 Ubuntu
zh_tw: 正在安裝 Ubuntu

# Onboarding_LocalSetup_Phase_Configure
source: Configuring instance
fr_fr: Configuration de l'instance
pt_br: Configurando a instância
zh_cn: 正在配置实例
zh_tw: 正在設定執行個體

# Onboarding_LocalSetup_Phase_InstallCli
source: Installing OpenClaw
fr_fr: Installation d'OpenClaw
pt_br: Instalando o OpenClaw
zh_cn: 正在安装 OpenClaw
zh_tw: 正在安裝 OpenClaw

# Onboarding_LocalSetup_Phase_PrepareConfig
source: Preparing gateway
fr_fr: Préparation de la passerelle
pt_br: Preparando o Gateway
zh_cn: 正在准备网关
zh_tw: 正在準備閘道

# Onboarding_LocalSetup_Phase_StartGateway
source: Starting gateway
fr_fr: Démarrage de la passerelle
pt_br: Iniciando o Gateway
zh_cn: 正在启动网关
zh_tw: 正在啟動閘道

# Onboarding_LocalSetup_Phase_MintToken
source: Generating setup code
fr_fr: Génération du code de configuration
pt_br: Gerando código de configuração
zh_cn: 正在生成设置代码
zh_tw: 正在產生設定碼

# AgentEventsPage_TextBlock_18.Text
source: Event Stream
fr_fr: Événements d’agent
pt_br: Fluxo de eventos
zh_cn: 代理事件
zh_tw: 代理程式事件

# AgentFilterCombo.Header
source: Agent
fr_fr: Agent logiciel
pt_br: Agente
zh_cn: 代理
zh_tw: 代理程式

# AgentFilterCombo.PlaceholderText
source: All Agents
fr_fr: Tous les agents
pt_br: Todos os agentes
zh_cn: 所有代理
zh_tw: 所有代理程式

# AgentEventsPage_IntroText.Text
source: Real-time stream of agent activity: tool calls, responses, errors, and lifecycle events.
fr_fr: Flux en temps réel de l'activité des agents: appels d'outils, réponses, erreurs et événements de cycle de vie.
pt_br: Fluxo de atividade dos agentes em tempo real: chamadas de ferramentas, respostas, erros e eventos do ciclo de vida
zh_cn: 代理活动的实时流……工具调用、响应、错误和生命周期事件。
zh_tw: 代理程式活動的即時串流……工具呼叫、回應、錯誤和生命週期事件。

# AgentEventsPage_ComboBoxItem_26.Content
source: All Agents
fr_fr: Tous les agents
pt_br: Todos os agentes
zh_cn: 所有代理
zh_tw: 所有代理程式

# AgentEventsPage_ToggleButton_36.Text
source: Tool
fr_fr: Outil
pt_br: Ferramenta
zh_cn: 工具
zh_tw: 工具

# AgentEventsPage_ToggleButton_37.Text
source: Assistant
fr_fr: Assistant virtuel
pt_br: Assistente
zh_cn: 助手
zh_tw: 助理

# AgentEventsPage_ToggleButton_38.Text
source: Error
fr_fr: Erreur
pt_br: Erro
zh_cn: 错误
zh_tw: 錯誤

# AgentEventsPage_ToggleButton_39.Text
source: Lifecycle
fr_fr: Cycle de vie
pt_br: Ciclo de vida
zh_cn: 生命周期
zh_tw: 生命週期

# AgentEventsPage_ToggleButton_40.Text
source: Plan
fr_fr: Planification
pt_br: Plano
zh_cn: 计划
zh_tw: 計畫

# AgentEventsPage_ToggleButton_41.Text
source: Approval
fr_fr: Approbation
pt_br: Aprovação
zh_cn: 批准
zh_tw: 核准

# AgentEventsPage_ToggleButton_42.Text
source: Thinking
fr_fr: Réflexion
pt_br: Pensamento
zh_cn: 思考中
zh_tw: 思考中

# AgentEventsPage_ToggleButton_43.Text
source: Patch
fr_fr: Correctif
pt_br: Alteração
zh_cn: 补丁
zh_tw: 修補程式

# AgentEventsPage_TextBlock_96.Text
source: No events in this session
fr_fr: Aucun événement d’agent pour le moment
pt_br: Nenhum evento nesta sessão
zh_cn: 还没有代理事件
zh_tw: 尚無代理程式事件

# AgentEventsPage_TextBlock_99.Text
source: Events stream here in real-time as agents run. History clears when the app restarts.
fr_fr: Les événements d’agent en temps réel (appels d’outils, réponses, erreurs) apparaîtront ici pendant l’exécution des agents.
pt_br: Os eventos aparecem aqui em tempo real conforme os agentes são executados. O histórico é limpo quando o aplicativo é reiniciado.
zh_cn: 代理运行时，实时代理事件（工具调用、响应、错误）将显示在此处。
zh_tw: 代理程式執行時，即時代理程式事件 (工具呼叫、回應、錯誤) 會顯示在這裡。

# ClearButton.Content
source: Clear
fr_fr: Effacer
pt_br: Limpar
zh_cn: 清除
zh_tw: 清除

# ClearButton.Text
source: Clear
fr_fr: Effacer
pt_br: Limpar
zh_cn: 清除
zh_tw: 清除

# BindingsPage_TextBlock_16.Text
source: Bindings
fr_fr: Liaisons
pt_br: Vinculações
zh_cn: 绑定
zh_tw: 繫結

# BindingsPage_TextBlock_17.Text
source: Message routing rules
fr_fr: Règles de routage des messages
pt_br: Regras de roteamento de mensagens
zh_cn: 消息路由规则
zh_tw: 訊息路由規則

# BindingsPage_TextBlock_25.Text
source: Refresh
fr_fr: Actualiser
pt_br: Atualizar
zh_cn: 刷新
zh_tw: 重新整理

# CapabilitiesPage_TextBlock_10.Text
source: 🖥️ This Computer
fr_fr: 🖥️ Cet ordinateur
pt_br: 🖥️ Este computador
zh_cn: 🖥️ 此计算机
zh_tw: 🖥️ 這部電腦

# PermissionsPage_IntroText.Text
source: Device capabilities provided to agents via the gateway. Toggle what this computer can do.
fr_fr: Fonctionnalités de l’appareil fournies aux agents via la passerelle. Activez ce que cet ordinateur peut faire.
pt_br: Recursos do dispositivo disponibilizados aos agentes por meio do Gateway. Defina o que este computador pode fazer.
zh_cn: 通过网关提供给代理的设备功能。切换此计算机可以执行的操作。
zh_tw: 透過閘道提供給代理程式的裝置功能。切換這部電腦可以執行的動作。

# PermissionsPage_McpHeader.Text
source: Local MCP Server
fr_fr: Serveur MCP local
pt_br: Servidor MCP local
zh_cn: 本地 MCP 服务器
zh_tw: 本機 MCP 伺服器

# PermissionsPage_McpDescription.Text
source: Serves capabilities to local MCP clients (CLI tools, integrations) on this PC over HTTP.
fr_fr: Fournit des fonctionnalités aux clients MCP locaux (outils CLI, intégrations) sur ce PC via HTTP.
pt_br: Disponibiliza recursos para clientes MCP locais (ferramentas CLI e integrações) neste PC por HTTP.
zh_cn: 通过 HTTP 向此电脑上的本地 MCP 客户端（CLI 工具、集成）提供功能。
zh_tw: 透過 HTTP 向此電腦上的本機 MCP 用戶端（CLI 工具、整合）提供功能。

# PermissionsPage_McpEndpointLabel.Text
source: Endpoint:
fr_fr: Point de terminaison :
pt_br: Ponto de extremidade:
zh_cn: 终结点：
zh_tw: 端點：

# CopyMcpTokenButton.Content
source: Copy Token
fr_fr: Copier le jeton
pt_br: Copiar token
zh_cn: 复制令牌
zh_tw: 複製權杖

# CopyMcpUrlButton.Content
source: Copy URL
fr_fr: Copier l’URL
pt_br: Copiar URL
zh_cn: 复制 URL
zh_tw: 複製 URL

# CapabilitiesPage_TextBlock_66.Text
source: Node Status
fr_fr: État du nœud
pt_br: Status do Node
zh_cn: 节点状态
zh_tw: 節點狀態

# NodeStatusText.Text
source: Node mode disabled
fr_fr: Mode nœud désactivé
pt_br: Modo Node desativado
zh_cn: 节点模式已禁用
zh_tw: 節點模式已停用

# ChannelsPage_TextBlock_10.Text
source: 📡 Channels
fr_fr: 📡 Canaux
pt_br: 📡 Canais
zh_cn: 📡 频道
zh_tw: 📡 頻道

# ConnectionWarning.Title
source: Not Connected
fr_fr: Non connecté
pt_br: Não conectado
zh_cn: 未连接
zh_tw: 未連線

# ChannelsPage_TextBlock_22.Text
source: No channels configured
fr_fr: Aucun canal configuré
pt_br: Nenhum canal configurado
zh_cn: 未配置频道
zh_tw: 未設定頻道

# ChatPage_TextBlock_53.Text
source: Connect to gateway to start chatting
fr_fr: Connectez-vous à la passerelle pour commencer la discussion
pt_br: Conecte-se ao Gateway para começar a conversar
zh_cn: 连接到网关以开始聊天
zh_tw: 連線到閘道以開始聊天

# ChatPage_WaitingTitle.Text
source: Waiting for chat to start…
fr_fr: En attente du démarrage du chat…
pt_br: Aguardando o início do chat…
zh_cn: 等待聊天启动…
zh_tw: 等待聊天啟動…

# ChatPage_WaitingStatusText.Text
source: The gateway is connected; the chat surface is still coming online.
fr_fr: La passerelle est connectée ; l'interface de chat est encore en cours de démarrage.
pt_br: O Gateway está conectado; o chat ainda está sendo iniciado.
zh_cn: 网关已连接；聊天界面仍在上线中。
zh_tw: 閘道已連接；聊天介面仍在上線中。

# ConfigPage_TextBlock_17.Text
source: Config
fr_fr: Configuration
pt_br: Configuração
zh_cn: 配置
zh_tw: 設定

# ConfigPage_TextBlock_21.Text
source: Refresh
fr_fr: Actualiser
pt_br: Atualizar
zh_cn: 刷新
zh_tw: 重新整理

# ConfigPage_OpenConnection.Content
source: Open Connection
fr_fr: Ouvrir la connexion
pt_br: Abrir conexão
zh_cn: 打开连接
zh_tw: 開啟連線

# ConfigPage_ConnectionInfoBar.Title
source: Gateway disconnected
fr_fr: Passerelle déconnectée
pt_br: Gateway desconectado
zh_cn: 网关已断开连接
zh_tw: 閘道已中斷連線

# ConfigPage_ConnectionInfoBar.Message
source: Connect to a gateway to load and save configuration.
fr_fr: Connectez-vous à une passerelle pour charger et enregistrer la configuration.
pt_br: Conecte-se a um Gateway para carregar e salvar a configuração.
zh_cn: 连接到网关以加载并保存配置。
zh_tw: 連線到閘道以載入並儲存設定。

# ConfigPage_LoadingText.Text
source: Loading gateway config...
fr_fr: Chargement de la configuration de la passerelle...
pt_br: Carregando configuração do Gateway...
zh_cn: 正在加载网关配置...
zh_tw: 正在載入閘道設定...

# ConfigPage_EditorLabel.Text
source: Editor
fr_fr: Éditeur
pt_br: Editor de configuração
zh_cn: 编辑器
zh_tw: 編輯器

# ConfigSearchBox.PlaceholderText
source: Filter settings
fr_fr: Filtrer les paramètres
pt_br: Filtrar configurações
zh_cn: 筛选设置
zh_tw: 篩選設定

# ToggleJsonPreviewButton.Content
source: Collapse JSON
fr_fr: Réduire JSON
pt_br: Recolher JSON
zh_cn: 折叠 JSON
zh_tw: 摺疊 JSON

# ToggleJsonPreviewButton_Show.Content
source: Show JSON
fr_fr: Afficher JSON
pt_br: Mostrar JSON
zh_cn: 显示 JSON
zh_tw: 顯示 JSON

# ResetSectionButton.Content
source: Reset section
fr_fr: Réinitialiser la section
pt_br: Redefinir seção
zh_cn: 重置部分
zh_tw: 重設區段

# DetailLoadingText.Text
source: Loading section...
fr_fr: Chargement de la section...
pt_br: Carregando seção...
zh_cn: 正在加载部分...
zh_tw: 正在載入區段...

# ConfigPage_LoadingFullConfigPreview
source: Loading full config preview...
fr_fr: Chargement de l’aperçu complet de la configuration...
pt_br: Carregando visualização completa da configuração...
zh_cn: 正在加载完整配置预览...
zh_tw: 正在載入完整設定預覽...

# ConfigPage_LoadingSectionFormat
source: Loading {0}...
fr_fr: Chargement de {0}...
pt_br: Carregando {0}...
zh_cn: 正在加载 {0}...
zh_tw: 正在載入 {0}...

# SelectedJsonPreviewTitle.Text
source: JSON preview
fr_fr: Aperçu JSON
pt_br: Visualização do JSON
zh_cn: JSON 预览
zh_tw: JSON 預覽

# SelectedJsonCaption.Text
source: Compare the gateway value with the proposed unsaved value.
fr_fr: Comparez la valeur de la passerelle avec la valeur non enregistrée proposée.
pt_br: Compare o valor do Gateway com o valor proposto ainda não salvo.
zh_cn: 比较网关值和建议的未保存值。
zh_tw: 比較閘道值與建議的未儲存值。

# CopySelectedJsonButton.Content
source: Copy
fr_fr: Copier
pt_br: Copiar
zh_cn: 复制
zh_tw: 複製

# DiscardButton.Content
source: Discard changes
fr_fr: Ignorer les modifications
pt_br: Descartar alterações
zh_cn: 放弃更改
zh_tw: 捨棄變更
